
plants_ua = {
    "Баобаб": "Африка",
    "Кактус": "Північна Америка",
    "Бамбук": "Азія",
    "Евкаліпт": "Австралія",
    "Дуб": "Європа",
    "Секвойя": "Північна Америка",
    "Ліана": "Південна Америка",
    "Лотос": "Азія",
    "Сосна": "Європа",
    "Пальма": "Африка",
    "Мох": "Антарктида",
}

plants_en = {}
for key in plants_ua:
    plants_en[key] = input(f"Назва рослини '{key}' англійською: ")

print("\n" + "-" * 30)
print("Перший словник (рослина - континент):")
for key in plants_ua:
    print(f"  {key} - {plants_ua[key]}")

print("\n Другий словник (рослина - англійська назва):")
for key in plants_en:
    print(f"  {key} - {plants_en[key]}")
print("-" * 30)